app/controllers/api/benches_controller.rb

    def index
        @benches = bounds ? Bench.in_bounds(bounds) : Bench.all
---
SELECT "benches".* FROM "benches"