app/controllers/application_controller.rb

    def current_user
        @current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "4dv3lKlnPqGqxi3CJ4-3Sw"], ["LIMIT", 1]]