app/models/user.rb

    def self.find_by_credentials(username, password)
        user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "arman"], ["LIMIT", 1]]

    def reset_session_token
        self.session_token = SecureRandom.urlsafe_base64(16)
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "Pv5IMelO2x9rv3oCaf0tDw"], ["updated_at", "2020-04-14 20:52:27.992788"], ["id", 2]]